<?php

return array(
    'reminder'=>array(
        'security'=>'账户安全',
        'trade'=>'支付交易',
        'wish'=>'节日祝福',
        'activity'=>'活动通知',
        'other'=>'其它',
    ),
    
    'status'=>array(
        'unactivated'=>'未激活',
        'normal'=>'正常',
        'freeze'=>'冻结',
        'deleted'=>'用户注销',
        'drop'=>'管理员删除',
    ),

    'login_mode'=>array(
        'normal'=>'直接登陆',
        'auto'=>'自动登录',
        'qq'=>'腾讯QQ',
        'weibo'=>'新浪微博',
        'renren'=>'人人网',
        'taobao'=>'淘宝账号',
    ),

    'login'=>array(
        0=>'登录成功',
        1=>'服务器繁忙',
        2=>'需要登录',
        3=>'已登录',
        4=>'错误请求',
        5 =>'密码长度错误',
        6=>'验证码错误',
        7=>'账号格式错误',
        8=>'账户或密码错误',
        9=>'用户状态异常',
    ),

    'register'=>array(
        0=>'注册成功',
        1=>'服务器繁忙',
        2=>'需要登录',
        3=>'已登录',
        4=>'错误请求',
        5 =>'密码长度错误',
        6=>'验证码错误',
        7=>'账号格式错误',
        8=>'账号已被注册',
        9=>'注册失败',
    ),

    'register_activation'=>array(
        0=>'激活码发送成功',
        1=>'服务器繁忙',
        2=>'需要登录',
        3=>'已登录',
        4=>'错误请求',
        5 =>'发送太频繁',
        6=>'激活账户错误',
    ),

    'register_result'=>array(
        'success'=>'恭喜您，注册成功',
        'fail'=>'激活失败，请重新再试或联系客服',
    ),

    'password_protection'=>array(
        0=>'请选择密保问题',
        1=>'我最喜欢在哪读我喜爱的书？',
        2=>'我的好朋友爱唱什么歌？',
        3=>'我最不想做的事情是什么？',
        4=>'爸爸(妈妈)的生日吃什么蛋糕？',
        5=>'我10岁生日那天许了什么愿？',
        6=>'妈妈最喜欢穿什么颜色的毛衣？',
        7=>'爷爷和奶奶每天散步走那条路？',
        8=>'我最想给谁倾诉我心里的委屈与难过？',
        9=>'女朋友（男朋友）夏天爱去哪溜冰？',
    ),


);